export function toRules(forLogo, forInfo) {
    forLogo.innerHTML = "Rules";

    forInfo.innerHTML = `
    <div class = "rules_block">
        <h3><span style = "color: red;">Leaflet</span></h3>
        <ul>
            <p>
                Администрация имеет полномочия наказывать игроков за нарушения, даже если эти нарушения не были явно перечислены в правилах ниже. Мы стремимся создать справедливую и безопасную игровую среду для всех участников, поэтому просьба соблюдать все правила, даже если они не были упомянуты явно.    
                <br><br>
                !!!<span style = "color: red;">Всё что связано с политикой, независимо от контекста - запрещено. Мы заходим сюда расслабиться и кайфануть!</span>!!!
            </p>
        <ul>
    </div>

    <div class = "rules_block">
        <h3>Discord Server</h3>
        <ul>
            <p>
                В нашем сообществе соблюдение нравственных и моральных норм является важным аспектом. Мы стремимся создать дружелюбную и уважительную атмосферу для всех участников. Поэтому, чтобы поддерживать эту атмосферу, мы просим вас соблюдать следующие правила общения:
                <br><br>
                Пожалуйста, не приглашайте на сервер других людей без предварительного разрешения администрации. Мы ценим приватность и безопасность каждого участника нашего сообщества, поэтому важно получить согласие от администрации перед приглашением кого-либо.
                <br><br>
                Спам запрещен во всех текстовых каналах. Мы стремимся создать место для качественного и ценного общения, поэтому пожалуйста, не размещайте повторяющиеся и ненужные сообщения, ссылки или рекламу. Уважайте время и внимание других участников.
                <br><br>
                Просим вас не использовать программы, такие как Soundpad, для воспроизведения громких и неприятных звуков в голосовых каналах. Мы стремимся создать комфортную обстановку для всех участников, поэтому просьба быть осмотрительными и уважительными к другим людям в голосовых каналах.
                <br><br>
                Текстовые каналы должны использоваться по назначению. Просим вас не злоупотреблять текстовыми каналами, не размещать в них контент, не связанный с основной тематикой канала. Это поможет поддерживать порядок и обеспечить лучшую организацию общения.
                <br><br>
                Пожалуйста, не отправляйте изображения или не пишите сообщения с чрезмерно грубым или пошлым содержанием. Мы стремимся создать приятную и уважительную атмосферу для всех участников, и такое поведение может нарушить эту атмосферу. Уважайте других участников и помните о том, что каждый имеет свои предпочтения и границы.
                <br><br>
                Соблюдение этих правил поможет нам поддерживать дружелюбную и уважительную атмосферу на нашем Discord сервере. Мы ценим ваше участие и вклад в наше сообщество и надеемся, что вы будете придерживаться этих норм во всех ваших взаимодействиях на сервере. Спасибо вам за внимание и соблюдение правил!
            </p>
        <ul>
    </div>

    <div class = "rules_block">
        <h3>Basic Discipline</h3>
        <ul>
            <p>
                Пожалуйста, воздержитесь от оскорблений, угроз, провокаций конфликта и исключений. Мы ценим каждого участника нашего сообщества и стремимся создать место, где все могут комфортно общаться. Поэтому просьба уважать других участников, избегать конфликтов и негативного поведения.
                <br><br>
                Важно понимать, что нарушение правил не оправдывается незнанием или неумышленными действиями. Каждый участник несет ответственность за свои поступки, даже если нарушение было совершено по ошибке. Просим вас быть внимательными и ознакомиться с правилами сервера, чтобы избежать нарушений.
                <br><br>
                Не используйте угрозы привлечения администрации для урегулирования конфликтов. Если возникают проблемы или разногласия, мы рекомендуем общаться конструктивно и с уважением друг к другу. Администрация всегда готова помочь разрешить споры, но просьба не злоупотреблять этой возможностью.
                <br><br>
                Запрещено обманывать других участников с целью получения выгоды. Мы стремимся создать честное и доверительное сообщество, где все могут чувствовать себя в безопасности. Просим вас быть честными и не злоупотреблять доверием других участников.
                <br><br>
                Запрещено распространение неприемлемого или оскорбительного контента, включая расизм, сексизм, гомофобию, ксенофобию и другие формы дискриминации. Мы стремимся создать инклюзивное сообщество, где каждый участник может чувствовать себя уважаемым и принятым. Просим вас избегать высказываний или действий, которые могут оскорбить или унизить других людей.
                <br><br>
                Запрещено нарушение авторских прав и публикация незаконного контента. Просим вас уважать интеллектуальную собственность других людей и не публиковать материалы, защищенные авторскими правами, без соответствующего разрешения. Также, не допускайте размещения незаконного или запрещенного контента на сервере.
                <br><br>
                Запрещено оскорбление или домогательство к другим участникам. Мы призываем всех участников быть вежливыми и уважительными в своих словах. Не допускайте прямого или косвенного оскорбления, угрозы, троллинга или любой формы домогательства к другим участникам.
                <br><br>
                Запрещено распространение личной информации других участников без их согласия. Мы придерживаемся принципа конфиденциальности и приватности. Просим вас не делиться личными данными других людей, такими как имена, адреса, номера телефонов или другая конфиденциальная информация без их явного разрешения.
            </p>
        <ul>
    </div>

    <div class = "rules_block">
        <h3>Minecraft Server</h3>
        <ul>
            <p>
            На нашем Minecraft сервере существуют следующие правила, которые помогут нам поддерживать честную и безопасную игровую среду:
            <br><br>
            1. Запрещено использование читов, которые дают вам неправедное преимущество над другими игроками. Мы стремимся создать честное игровое пространство, где все участники могут наслаждаться игрой на равных условиях. Просим вас не использовать никакие программы или модификации, которые дают вам нечестное преимущество, и соблюдать правила игры.
            <br><br>
            2. Постройка лаг-машин и любые действия, направленные на краш сервера, строго запрещены. Мы ценим стабильность сервера и комфортную игру для всех участников. Просим вас не создавать механизмы, которые могут вызывать значительные задержки (лаги) или приводить к падению сервера.
            <br><br>
            3. Запрещено наносить имуществу других игроков слишком сильный урон, который затрудняет или делает невозможным восстановление. Мы стремимся создать дружественную и сотрудничающую среду, где игроки могут взаимодействовать и строить вместе. Просим вас быть тактичными и не наносить непропорциональные разрушения чужим постройкам или имуществу.
            <br><br>
            4. В мирных зонах PvP (игрок против игрока) строго запрещено. Мы предоставляем мирные зоны, где игроки могут безопасно и спокойно строить и взаимодействовать. Просим вас не использовать PvP в таких зонах, чтобы сохранить мирную атмосферу и защитить игроков, которые не желают участвовать в PvP битвах.
            <br><br>
            5. Запрещена осада домов в течение длительного времени. Мы призываем всех игроков быть уважительными к другим их труду и творчеству. Просим вас не осаждать дома или строения других игроков в течение продолжительного времени и не мешать им наслаждаться игровым процессом.
            <br><br>
            6. Игровой чат на сервере подчиняется тем же правилам, что и текстовые каналы в Discord. Просим вас быть вежливыми, уважительными и избегать использования оскорблений, провокаций или распространения неподобающего контента. Мы стремимся создать приятное и дружественное сообщество, где все игроки могут коммуницировать безопасно и комфортно.
            <br><br>
            Пожалуйста, соблюдайте эти правила и помогайте нам создавать приятную игровую атмосферу на нашем Minecraft сервере. Спасибо вам за ваше сотрудничество и участие в нашем сообществе!
            </p>
        <ul>
    </div>
    `;
}
